# 14. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# 6782 -> 23
# 0,56 -> 11

# number = input('Enter number: ')

# def SumNumbers(number):
#     sum = 0
#     for i in number:
#      if i != '.':
#         sum += int(i)
#     return sum


# print(f'The sum of the digits of the number  {number} is {SumNumbers(number)} ')

# 15. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# number = int(input('Enter number: '))
# prodact = 1

# for i in range(1,number+1):
#     prodact *= i
#     print(prodact, end=' ')
    
    